tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
void HardFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void BusFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void SysTick_Handler(void)
{
    absolute_tick++;
    
    parse();

    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }
}

void USART1_IRQHandler(void)
{
    uint8_t in_char = (USART1->DR & 0xFF);
    buffer_char(in_char);
}

void EXTI1_IRQHandler(void)
{
    // Core critical section, nothing shall happen here
    __disable_irq();
    int16_t cnt = TIM3->CNT;
    TIM3->CNT = 0;

    absolute_pos += cnt;

    if (cnt < 0) {
        absolute_idx--;
    } else {
        absolute_idx++;
    }

    EXTI->PR |= EXTI_PR_PR1;

    if (cnt != 3 && cnt != -3 &&
        cnt != 2880 && cnt != -2880) {
        error_index_offset = (int32_t)cnt;
    }
    
    if (cnt == 2880 || cnt == -2880) {
        index_zero_occured = 1;
    }

    static int32_t last_absolute_tick = 0;
    current_index_delta = abs(absolute_tick - last_absolute_tick);
    last_absolute_tick = absolute_tick;
    __enable_irq();
}

void TIM2_IRQHandler(void)
{
    static int32_t stepper_dir_x = 0; // direction is undefined by default
    static int32_t stepper_dir_z = 0; // direction is undefined by default

    if ((TIM2->SR & TIM_SR_UIF)) {
        TIM2->SR &= ~(TIM_SR_UIF);

        // Do nothing if we are in stop sync mode
        if (current_run_mode == run_mode_none ||
            current_run_mode == run_mode_idle) {
            return;
        }
        
        // Protect against TIM3 IRQ race
        __disable_irq();
        int16_t cnt = TIM3->CNT;
        int64_t absolute_actual_pos = absolute_pos;

        absolute_actual_pos += cnt - absolute_pos_start_offset;

        if (wait_for_index_zero) {
            if (index_zero_occured && current_run_mode != run_mode_cycle_pause) {
                wait_for_index_zero = 0;
                index_zero_occured = 0;
                absolute_pos_start_offset = cnt;
                absolute_pos = 0;
                absolute_actual_pos = 0;
                stepper_actual_pos_z = 0;
                stepper_actual_pos_x = 0;
                stepper_off_z = 0;
                stepper_off_x = 0;
            } else {
                // Do nothing until we hit index zero
                __enable_irq();
                return;
            }
        }
        __enable_irq();

        static uint32_t flip_z = 0;
        if (flip_z) {
            // by default, don't move
            int64_t stepper_target_pos_z = stepper_actual_pos_z;

            switch (current_run_mode) {
                case    run_mode_follow_zx:
                case    run_mode_follow_z: {
                            stepper_target_pos_z = libdivide::libdivide_s64_do(absolute_actual_pos * int64_t(stepper_follow_mul_z), &stepper_follow_div_z_opt);
                            stepper_target_pos_z += stepper_off_z;
                        } break;
                case    run_mode_jog_zx:    
                case    run_mode_jog_z: {
                            stepper_target_pos_z = stepper_actual_pos_z;
                            if (--stepper_jog_tck_z <= 0) {
                                // Reset
                                stepper_jog_tck_z = stepper_jog_tim_z;
                                // Advance
                                if (stepper_jog_dir_z < 0) {
                                    stepper_target_pos_z --;
                                }
                                if (stepper_jog_dir_z > 0) {
                                    stepper_target_pos_z ++;
                                }
                            }
                        } break;
                case    run_mode_cycle_pause:
                case    run_mode_cycle: {
                            int32_t mul_z = current_cycle[current_cycle_idx].stepper_mul_z;
                            const libdivide::libdivide_s64_t &div_z_opt = current_cycle[current_cycle_idx].stepper_div_z_opt;
                            stepper_target_pos_z = libdivide::libdivide_s64_do(absolute_actual_pos * int64_t(mul_z), &div_z_opt);
                            stepper_target_pos_z += stepper_off_z;
                        } break;
                default: {
                        } break;
            }
            
            int32_t szdelta = int32_t(stepper_target_pos_z - stepper_actual_pos_z);

            if (abs(szdelta) >= 2880) {
                error_state_out_of_sync = szdelta;
            }

            if (szdelta == 0) {
                // nop
            } else if (szdelta < 0) {
                if (stepper_dir_z != -1) {
                    stepper_dir_z = -1;
                    GPIOB->BSRR = GPIO_BSRR_BR14;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_z--;
                    GPIOB->BSRR = GPIO_BSRR_BS13;
                    flip_z ^= 1;
                }
            } else if (szdelta > 0) {
                if (stepper_dir_z != +1) {
                    stepper_dir_z = +1;
                    GPIOB->BSRR = GPIO_BSRR_BS14;        
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_z++;
                    GPIOB->BSRR = GPIO_BSRR_BS13;
                    flip_z ^= 1;
                }
            }
            
        } else {
            GPIOB->BSRR = GPIO_BSRR_BR13;
            flip_z ^= 1;
        }

        static uint32_t flip_x = 0;
        if (flip_x) {
            int64_t stepper_target_pos_x = stepper_actual_pos_x;
            
            switch (current_run_mode) {
                case    run_mode_follow_zx:
                case    run_mode_follow_x: {
                            stepper_target_pos_x = libdivide::libdivide_s64_do(absolute_actual_pos * int64_t(stepper_follow_mul_x), &stepper_follow_div_x_opt);
                            stepper_target_pos_x += stepper_off_x;
                        } break;
                case    run_mode_jog_zx:    
                case    run_mode_jog_x: {
                            if (--stepper_jog_tck_x <= 0) {
                                // Reset
                                stepper_jog_tck_x = stepper_jog_tim_x;
                                // Advance
                                if (stepper_jog_dir_x < 0) {
                                    stepper_target_pos_x --;
                                }
                                if (stepper_jog_dir_x > 0) {
                                    stepper_target_pos_x ++;
                                }
                            }
                        } break;
                case    run_mode_cycle_pause:
                case    run_mode_cycle: {
                            int32_t mul_x = current_cycle[current_cycle_idx].stepper_mul_x;
                            const libdivide::libdivide_s64_t &div_x_opt = current_cycle[current_cycle_idx].stepper_div_x_opt;
                            stepper_target_pos_x = libdivide::libdivide_s64_do(absolute_actual_pos * int64_t(mul_x), &div_x_opt);
                            stepper_target_pos_x += stepper_off_x;
                        } break;
                default: {
                        } break;
            }

            int32_t sxdelta = int32_t(stepper_target_pos_x - stepper_actual_pos_x);

