tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
        stepper_off_x = stepper_actual_pos_x;

        absolute_pos = 0;
        absolute_pos_start_offset = cnt;
    }
                        
    __enable_irq();
}

static void send_bad_crc_response()
{
    std::string response = "BADCRC0000\n";
    uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(response.c_str()), 5);
    response[sizeof(response)-5] = int2hex[((crc>>12)&0xF)];
    response[sizeof(response)-4] = int2hex[((crc>> 8)&0xF)];
    response[sizeof(response)-3] = int2hex[((crc>> 4)&0xF)];
    response[sizeof(response)-2] = int2hex[((crc>> 0)&0xF)];
    for (size_t c=0; c<sizeof(response); c++) {
        put_char(response[c]);
    }
}

static void send_ok_response()
{
    std::string response = "OK0000\n";
    uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(response.c_str()), 2);
    response[sizeof(response)-5] = int2hex[((crc>>12)&0xF)];
    response[sizeof(response)-4] = int2hex[((crc>> 8)&0xF)];
    response[sizeof(response)-3] = int2hex[((crc>> 4)&0xF)];
    response[sizeof(response)-2] = int2hex[((crc>> 0)&0xF)];
    for (size_t c=0; c<sizeof(response); c++) {
        put_char(response[c]);
    }
}

static void send_invalid_response()
{
    std::string response = "INVALID0000\n";
    uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(response.c_str()), 7);
    response[sizeof(response)-5] = int2hex[((crc>>12)&0xF)];
    response[sizeof(response)-4] = int2hex[((crc>> 8)&0xF)];
    response[sizeof(response)-3] = int2hex[((crc>> 4)&0xF)];
    response[sizeof(response)-2] = int2hex[((crc>> 0)&0xF)];
    for (size_t c=0; c<sizeof(response); c++) {
        put_char(response[c]);
    }
}

static void parse(void) {
    uint8_t in_char;
    static std::string cmd;
    while(get_char(&in_char)) {
        if(in_char != '\n') {
            cmd.append(1, char(in_char));
        } else {

            if (cmd.size()<4) {
                send_bad_crc_response();
                cmd.clear();
                continue;
            }

            const size_t size_of_crc = 4;

            // Check CRC16 for every command
            const uint8_t *cmd_data = reinterpret_cast<const uint8_t *>(cmd.data());
            uint16_t crc = CRC16(cmd_data, cmd.size() - size_of_crc);
            if ((char(int2hex[((crc>>12)&0xF)]) != cmd_data[cmd.size()-4])||
                (char(int2hex[((crc>> 8)&0xF)]) != cmd_data[cmd.size()-3])||
                (char(int2hex[((crc>> 4)&0xF)]) != cmd_data[cmd.size()-2])||
                (char(int2hex[((crc>> 0)&0xF)]) != cmd_data[cmd.size()-1])) {
                send_bad_crc_response();
                cmd.clear();
                continue;
            }

            // Command valid, execute
            switch(cmd[0]) {

                // Set X/Z feed rate
                case 'X':
                case 'Z': {
                            if (cmd.size() < (1 + 16 + size_of_crc)) {
                                send_invalid_response();
                            } else {
                                int32_t mul = int32_t(std::stoul(cmd.substr(1,8), nullptr, 16)); // 8
                                int32_t div = int32_t(std::stoul(cmd.substr(9,8), nullptr, 16)); // 16
                                if (div < 0) {
                                    send_invalid_response();
                                    break;
                                }
                                set_follow_values(cmd[0] == 'Z' ? 0 : 1, mul, div);
                                send_ok_response();
                            }
                        } break;

                // Follow mode
                case 'F': {
                            if (cmd.size() < (1 + 1) || (cmd[1] != 'Z' && cmd[1] != 'X'  && cmd[1] != 'B')) {
                                send_invalid_response();
                            } else {
                                switch(cmd[1]) {
                                    case    'Z': {
                                                set_current_run_mode(run_mode_follow_z);
                                            } break;
                                    case    'X': {
                                                set_current_run_mode(run_mode_follow_x);
                                            } break;
                                    case    'B': {
                                                set_current_run_mode(run_mode_follow_zx);
                                            } break;
                                }
                                send_ok_response();
                            }
                        } break;

                // Halt and Idle!
                case 'H': {
                            if (cmd.size() < (1 + 1) || (cmd[1] != '1' && cmd[1] != '0')) {
                                send_invalid_response();
                            } else {
                                set_current_run_mode(cmd[1] == '1' ? run_mode_idle : run_mode_none);
                                send_ok_response();
                            }
                        } break;
                        
                // Run cycle
                case 'C': {
                            // Set to none while we are parsing
                            set_current_run_mode(run_mode_none);

                            size_t pos = 1;
                            bool ok_to_run = true;
                            int32_t prev_target_pos = 0;

                            current_cycle_idx = 0;
                            current_cycle.clear();

                            for ( ; pos < (cmd.size() - size_of_crc - 1) ; ) {

                                if ((cmd.size() - size_of_crc - pos) < 49) {
                                    ok_to_run = false;
                                    break;
                                }
                                
                                if (cmd[pos] != 'X' && cmd[pos] != 'Z') {
                                    ok_to_run = false;
                                    break;
                                }

