tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
                                cycle_entry entry;
                                entry.target_axs = (cmd[pos] == 'X') ? 1 : 0; pos++; // 1
                                entry.target_pos = int32_t(std::stoul(cmd.substr(pos,8), nullptr, 16)); pos += 8; // 9
                                entry.stepper_mul_z = int32_t(std::stoul(cmd.substr(pos,8), nullptr, 16)); pos += 8; // 17
                                entry.stepper_div_z = int32_t(std::stoul(cmd.substr(pos,8), nullptr, 16)); pos += 8; // 25
                                entry.stepper_mul_x = int32_t(std::stoul(cmd.substr(pos,8), nullptr, 16)); pos += 8; // 33
                                entry.stepper_div_x = int32_t(std::stoul(cmd.substr(pos,8), nullptr, 16)); pos += 8; // 41
                                entry.wait_for_index_zero = int32_t(std::stoul(cmd.substr(pos,8), nullptr, 16)); pos += 8; // 49
                                
                                entry.stepper_div_z_opt = libdivide::libdivide_s64_gen(entry.stepper_div_z);
                                entry.stepper_div_x_opt = libdivide::libdivide_s64_gen(entry.stepper_div_x);
                                
                                if (entry.stepper_div_z < 0 ||
                                    entry.stepper_div_x < 0) {
                                    current_cycle.clear();
                                    ok_to_run = false;
                                    break;
                                }
                                
                                // verify
                                if (entry.target_axs == 0) {
                                    if (entry.stepper_mul_z > 0 && prev_target_pos > entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                    if (entry.stepper_mul_z < 0 && prev_target_pos < entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                } else {
                                    if (entry.stepper_mul_x > 0 && prev_target_pos > entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                    if (entry.stepper_mul_x < 0 && prev_target_pos < entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                }
                                prev_target_pos = entry.target_pos;
                                
                                current_cycle.push_back(entry);
                            }
                            
                            if (ok_to_run && current_cycle.size() > 0) {
                                set_current_run_mode(run_mode_cycle);
                                send_ok_response();
                            } else {
                                current_cycle.clear();
                                send_invalid_response();
                            }
                        } break;

                // Pause cycle
                case 'P': {
                            if (cmd.size() < (1 + 1) || (cmd[1] != '1' && cmd[1] != '0') || current_run_mode != run_mode_cycle) {
                                send_invalid_response();
                            } else {
                                set_current_run_mode(cmd[1] == '1' ? run_mode_cycle_pause : run_mode_cycle);
                                send_ok_response();
                            }
                        } break;
                        
                // Reset to zero
                case 'R': {
                            set_zero_pos();
                            send_ok_response();
                        }

                // Get raw status
                case 'S': {
                            int16_t cnt = TIM3->CNT;

                            std::string response;
                            
                            char str[32];

                            /* broken in stdc++ which is part of gcc-7.3.1
                            snprintf(str, 32, "%016llX", uint64_t(absolute_pos + cnt)); response.append(str); // 1
                            snprintf(str, 32, "%016llX", uint64_t(stepper_actual_pos_z)); response.append(str); // 2
                            snprintf(str, 32, "%016llX", uint64_t(stepper_actual_pos_x)); response.append(str); // 3
                            */

                            snprintf(str, 32, "%08lX%08lX", uint32_t(uint64_t(absolute_pos + cnt  )>>32),
                                                            uint32_t(uint64_t(absolute_pos + cnt  ))); response.append(str); // 1
                            snprintf(str, 32, "%08lX%08lX", uint32_t(uint64_t(stepper_actual_pos_z)>>32),
                                                            uint32_t(uint64_t(stepper_actual_pos_z))); response.append(str); // 2
                            snprintf(str, 32, "%08lX%08lX", uint32_t(uint64_t(stepper_actual_pos_x)>>32),
                                                            uint32_t(uint64_t(stepper_actual_pos_x))); response.append(str); // 3

                            snprintf(str, 32, "%08lX", uint32_t(cnt)); response.append(str); // 4
                            snprintf(str, 32, "%08lX", uint32_t(absolute_idx)); response.append(str); // 5
                            snprintf(str, 32, "%08lX", uint32_t(current_index_delta)); response.append(str); // 6
                            snprintf(str, 32, "%08lX", uint32_t(absolute_pos_start_offset)); response.append(str); // 7
                            snprintf(str, 32, "%08lX", uint32_t(stepper_follow_mul_z)); response.append(str); // 8
                            snprintf(str, 32, "%08lX", uint32_t(stepper_follow_div_z)); response.append(str); // 9
                            snprintf(str, 32, "%08lX", uint32_t(stepper_follow_mul_x)); response.append(str); // 10
                            snprintf(str, 32, "%08lX", uint32_t(stepper_follow_div_x)); response.append(str); // 11
                            snprintf(str, 32, "%08lX", uint32_t(error_state_out_of_sync)); response.append(str); // 12
                            snprintf(str, 32, "%08lX", uint32_t(error_index_offset)); response.append(str); // 13
                            snprintf(str, 32, "%08lX", uint32_t(absolute_tick)); response.append(str); // 14

                            uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(response.data()), response.size());

                            response.append(1,char(int2hex[((crc>>12)&0xF)]));
                            response.append(1,char(int2hex[((crc>> 8)&0xF)]));
                            response.append(1,char(int2hex[((crc>> 4)&0xF)]));
                            response.append(1,char(int2hex[((crc>> 0)&0xF)]));

                            response.append(1,'\n');

                            // Send the ascii-fied data over UART
                            for (size_t c=0; c<response.size(); c++) {
                                put_char(response[c]);
                            }

